In [1]:
import pymysql
import pandas as pd
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

 ![png](images/image_ERD.png)

In [2]:
connection = "mysql+pymysql://root:Afshan0712@localhost/books"

In [3]:
engine = create_engine(connection, echo=True)

In [4]:
engine

Engine(mysql+pymysql://root:***@localhost/books)

In [6]:
database_exists(connection)

True

In [7]:
df= pd.read_csv('Data/data.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [8]:
df.to_sql('data', engine, if_exists = 'replace')

2022-12-17 10:47:30,825 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-12-17 10:47:30,827 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:30,833 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2022-12-17 10:47:30,834 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:30,837 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2022-12-17 10:47:30,840 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:30,853 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:30,858 INFO sqlalchemy.engine.Engine [generated in 0.00455s] {'table_schema': 'books', 'table_name': 'data'}
2022-12-17 10:47:30,873 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:30,874 INFO sqlalchemy.engine.Engine [cached since 0.02121s ago] {'table_schema': 'books', 'table_name': 'data'}
2022-12-17 10:47:30,889 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `books`
2022-12-17 10:47:30,892 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:30,927 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `data`
2022-12-17 10:47:30,930 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:30,958 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:30,960 INFO sqlalchemy.engine.Engine
DROP TABLE data
2022-12-17 10:47:30,963 INFO sqlalchemy.engine.Engine [no key 0.00301s] {}
2022-12-17 10:47:31,040 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:31,044 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:31,045 INFO sqlalchemy.engine.Engine
CREATE TABLE data (
	`index` BIGINT,
	id BIGINT,
	first_name TEXT,
	last_name TEXT,
	email TEXT
)


2022-12-17 10:47:31,046 INFO sqlalchemy.engine.Engine [no key 0.00136s] {}
2022-12-17 10:47:31,090 INFO sqlalchemy.engine.Engine CREATE INDEX ix_data_index ON data (`index`)
2022-12-17 10:47:31,093 INFO sqlalchemy.engine.Engine [no key 0.00333s] {}
2022-12-17 10:47:31,135 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:31,139 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:31,145 INFO sqlalchemy.engine.Engine INSERT INTO data (`index`, id, first_name, last_name, email) VALUES (%(index)s, %(id)s, %(first_name)s, %(last_name)s, %(email)s)
2022-12-17 10:47:31,147 INFO sqlalchemy.engine.Engine [generated in 0.00216s] ({'index': 0, 'id': 1, 'first_name': 'John', 'last_name': 'Doe', 'email': 'JD@books.com'}, {'index': 1, 'id': 2, 'first_name': 'Robin', 'last_name': 'Smith', 'email': 'Robin@books.com'}, {'index': 2, 'id': 3, 'first_name': 'Gloria', 'last_name': 'Rodriguez', 'email': 'grodriquez@books.com'})
2022-12-17 10:47:31,154 INFO sqlalchemy.engine.Engine COMMIT

3

In [9]:
q = """SELECT * FROM Data LIMIT 5;"""
pd.read_sql(q, engine)

2022-12-17 10:47:31,493 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:31,496 INFO sqlalchemy.engine.Engine [cached since 0.6426s ago] {'table_schema': 'books', 'table_name': 'SELECT * FROM Data LIMIT 5;'}
2022-12-17 10:47:31,504 INFO sqlalchemy.engine.Engine SELECT * FROM Data LIMIT 5;
2022-12-17 10:47:31,506 INFO sqlalchemy.engine.Engine [raw sql] {}

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [10]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

2022-12-17 10:47:32,060 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:32,065 INFO sqlalchemy.engine.Engine [cached since 1.212s ago] {'table_schema': 'books', 'table_name': 'SHOW TABLES;'}
2022-12-17 10:47:32,071 INFO sqlalchemy.engine.Engine SHOW TABLES;
2022-12-17 10:47:32,074 INFO sqlalchemy.engine.Engine [raw sql] {}

  Tables_in_books
0            data
1          data-2
2          data-3
3          data-4
4          data_2
5          data_3
6          data_4

In [11]:
df_2 = pd.read_csv('data/data-2.csv')
df_3 = pd.read_csv('data/data-3.csv')
df_4 = pd.read_csv('data/data-4.csv')

In [12]:
df_2.to_sql('data_2', engine, if_exists = 'replace')
df_3.to_sql('data_3', engine, if_exists = 'replace')
df_4.to_sql('data_4', engine, if_exists = 'replace')

2022-12-17 10:47:33,251 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:33,254 INFO sqlalchemy.engine.Engine [cached since 2.401s ago] {'table_schema': 'books', 'table_name': 'data_2'}
2022-12-17 10:47:33,264 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:33,265 INFO sqlalchemy.engine.Engine [cached since 2.412s ago] {'table_schema': 'books', 'table_name': 'data_2'}
2022-12-17 10:47:33,277 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `books`
2022-12-17 10:47:33,280 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:33,286 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `data_2`
2022-12-17 10:47:33,288 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:33,308 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:33,312 INFO sqlalchemy.engine.Engine
DROP TABLE data_2
2022-12-17 10:47:33,316 INFO sqlalchemy.engine.Engine [no key 0.00335s] {}
2022-12-17 10:47:33,338 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:33,348 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:33,350 INFO sqlalchemy.engine.Engine
CREATE TABLE data_2 (
	`index` BIGINT,
	id BIGINT,
	title TEXT,
	author_id BIGINT
)


2022-12-17 10:47:33,352 INFO sqlalchemy.engine.Engine [no key 0.00156s] {}
2022-12-17 10:47:33,388 INFO sqlalchemy.engine.Engine CREATE INDEX ix_data_2_index ON data_2 (`index`)
2022-12-17 10:47:33,391 INFO sqlalchemy.engine.Engine [no key 0.00237s] {}
2022-12-17 10:47:33,422 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:33,426 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:33,436 INFO sqlalchemy.engine.Engine INSERT INTO data_2 (`index`, id, title, author_id) VALUES (%(index)s, %(id)s, %(title)s, %(author_id)s)
2022-12-17 10:47:33,441 INFO sqlalchemy.engine.Engine [generated in 0.00581s] ({'index': 0, 'id': 1, 'title': 'The Shining', 'author_id': 1}, {'index': 1, 'id': 2, 'title': 'It', 'author_id': 1}, {'index': 2, 'id': 3, 'title': 'The Great Gatsby', 'author_id': 2}, {'index': 3, 'id': 4, 'title': 'The Call of the Wild', 'author_id': 3}, {'index': 4, 'id': 5, 'title': 'Pride and Prejudice', 'author_id': 4}, {'index': 5, 'id': 6, 'title': 'Frankenstein', 'author_id': 5})
2022-12-17 10:47:33,452 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:33,467 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:33,468 INFO sqlalchemy.engine.Engine [cached since 2.615s ago] {'table_schema': 'books', 'table_name': 'data_3'}
2022-12-17 10:47:33,474 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:33,475 INFO sqlalchemy.engine.Engine [cached since 2.622s ago] {'table_schema': 'books', 'table_name': 'data_3'}
2022-12-17 10:47:33,482 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `books`
2022-12-17 10:47:33,483 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:33,489 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `data_3`
2022-12-17 10:47:33,490 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:33,500 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:33,502 INFO sqlalchemy.engine.Engine
DROP TABLE data_3
2022-12-17 10:47:33,507 INFO sqlalchemy.engine.Engine [no key 0.00494s] {}
2022-12-17 10:47:33,521 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:33,528 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:33,535 INFO sqlalchemy.engine.Engine
CREATE TABLE data_3 (
	`index` BIGINT,
	id BIGINT,
	author_name TEXT
)


2022-12-17 10:47:33,536 INFO sqlalchemy.engine.Engine [no key 0.00181s] {}
2022-12-17 10:47:33,565 INFO sqlalchemy.engine.Engine CREATE INDEX ix_data_3_index ON data_3 (`index`)
2022-12-17 10:47:33,567 INFO sqlalchemy.engine.Engine [no key 0.00161s] {}
2022-12-17 10:47:33,585 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:33,591 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:33,599 INFO sqlalchemy.engine.Engine INSERT INTO data_3 (`index`, id, author_name) VALUES (%(index)s, %(id)s, %(author_name)s)
2022-12-17 10:47:33,602 INFO sqlalchemy.engine.Engine [generated in 0.00332s] ({'index': 0, 'id': 1, 'author_name': 'Stephen King'}, {'index': 1, 'id': 2, 'author_name': 'F.Scott Fitgerald'}, {'index': 2, 'id': 3, 'author_name': 'Jack London'}, {'index': 3, 'id': 4, 'author_name': 'Jane Austen'}, {'index': 4, 'id': 5, 'author_name': 'Mary Shelley'})
2022-12-17 10:47:33,606 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:33,612 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:33,613 INFO sqlalchemy.engine.Engine [cached since 2.76s ago] {'table_schema': 'books', 'table_name': 'data_4'}
2022-12-17 10:47:33,620 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:33,621 INFO sqlalchemy.engine.Engine [cached since 2.768s ago] {'table_schema': 'books', 'table_name': 'data_4'}
2022-12-17 10:47:33,627 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `books`
2022-12-17 10:47:33,629 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:33,641 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `data_4`
2022-12-17 10:47:33,643 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-17 10:47:33,653 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:33,655 INFO sqlalchemy.engine.Engine
DROP TABLE data_4
2022-12-17 10:47:33,658 INFO sqlalchemy.engine.Engine [no key 0.00321s] {}
2022-12-17 10:47:33,669 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:33,674 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:33,676 INFO sqlalchemy.engine.Engine
CREATE TABLE data_4 (
	`index` BIGINT,
	user_id BIGINT,
	book_id BIGINT
)


2022-12-17 10:47:33,679 INFO sqlalchemy.engine.Engine [no key 0.00290s] {}
2022-12-17 10:47:33,705 INFO sqlalchemy.engine.Engine CREATE INDEX ix_data_4_index ON data_4 (`index`)
2022-12-17 10:47:33,708 INFO sqlalchemy.engine.Engine [no key 0.00323s] {}
2022-12-17 10:47:33,728 INFO sqlalchemy.engine.Engine COMMIT
2022-12-17 10:47:33,734 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-17 10:47:33,738 INFO sqlalchemy.engine.Engine INSERT INTO data_4 (`index`, user_id, book_id) VALUES (%(index)s, %(user_id)s, %(book_id)s)
2022-12-17 10:47:33,744 INFO sqlalchemy.engine.Engine [generated in 0.00629s] ({'index': 0, 'user_id': 1, 'book_id': 1}, {'index': 1, 'user_id': 1, 'book_id': 2}, {'index': 2, 'user_id': 1, 'book_id': 3}, {'index': 3, 'user_id': 2, 'book_id': 4}, {'index': 4, 'user_id': 2, 'book_id': 5}, {'index': 5, 'user_id': 3, 'book_id': 5}, {'index': 6, 'user_id': 3, 'book_id': 6})
2022-12-17 10:47:33,758 INFO sqlalchemy.engine.Engine COMMIT

7

In [13]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

2022-12-17 10:47:33,891 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:33,896 INFO sqlalchemy.engine.Engine [cached since 3.043s ago] {'table_schema': 'books', 'table_name': 'SHOW TABLES;'}
2022-12-17 10:47:33,902 INFO sqlalchemy.engine.Engine SHOW TABLES;
2022-12-17 10:47:33,906 INFO sqlalchemy.engine.Engine [raw sql] {}

  Tables_in_books
0            data
1          data-2
2          data-3
3          data-4
4          data_2
5          data_3
6          data_4

In [14]:
q= """ SELECT * FROM data
"""
pd.read_sql(q, engine)

2022-12-17 10:47:34,371 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:34,377 INFO sqlalchemy.engine.Engine [cached since 3.524s ago] {'table_schema': 'books', 'table_name': ' SELECT * FROM data\n'}
2022-12-17 10:47:34,382 INFO sqlalchemy.engine.Engine  SELECT * FROM data

2022-12-17 10:47:34,386 INFO sqlalchemy.engine.Engine [raw sql] {}

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [15]:
q = """ SELECT * FROM data_2
"""
pd.read_sql(q, engine)

2022-12-17 10:47:34,898 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:34,902 INFO sqlalchemy.engine.Engine [cached since 4.049s ago] {'table_schema': 'books', 'table_name': ' SELECT * FROM data_2\n'}
2022-12-17 10:47:34,908 INFO sqlalchemy.engine.Engine  SELECT * FROM data_2

2022-12-17 10:47:34,910 INFO sqlalchemy.engine.Engine [raw sql] {}

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

In [16]:
q = """
SELECT data_2.title , data_4.user_id

FROM data_2

JOIN data_4 ON data_2.id = data_4.book_id

WHERE data_4.user_id = 

    (SELECT data.id FROM data WHERE (data.last_name = 'Doe'
    AND data.first_name = 'John'));

"""
pd.read_sql(q, engine)

2022-12-17 10:47:35,548 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-17 10:47:35,553 INFO sqlalchemy.engine.Engine [cached since 4.7s ago] {'table_schema': 'books', 'table_name': "\nSELECT data_2.title , data_4.user_id\n\nFROM data_2\n\nJOIN data_4 ON data_2.id = data_4.book_id\n\nWHERE data_4.user_id = \n\n    (SELECT data.id FROM data WHERE (data.last_name = 'Doe'\n    AND data.first_name = 'John'));\n\n"}
2022-12-17 10:47:35,557 INFO sqlalchemy.engine.Engine
SELECT data_2.title , data_4.user_id

FROM data_2

JOIN data_4 ON data_2.id = data_4.book_id

WHERE data_4.user_id =

    (SELECT data.id FROM data WHERE (data.last_name = 'Doe'
    AND data.first_name = 'John'));


2022-12-17 10:47:35,563 INFO sqlalchemy.engine.Engine [raw sql] {}

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1